Let ρ = [i=1,v=5,x=10].

(value-of
  <<-(-(x,3), -(v,i))>>
  ρ)

＝ ⌈(-
     ⌊(value-of <<-(x,3)>> ρ)⌋
     ⌊(value-of <<-(v,i)>> ρ)⌋)⌉

＝ ⌈(-
      (-
        ⌊(value-of <<x>> ρ)⌋ 
        ⌊(value-of <<3>> ρ)⌋)
      ⌊(value-of <<-(v,i)>> ρ)⌋)⌉

＝ ⌈(-
      (-
        10 
        ⌊(value-of <<3>> ρ)⌋)
      ⌊(value-of <<-(v,i)>> ρ)⌋)⌉

＝ ⌈(-
      (-
        10
        3)
      ⌊(value-of <<-(v,i)>> ρ)⌋)⌉

＝ ⌈(-
      7
      ⌊(value-of <<-(v,i)>> ρ)⌋)⌉

＝ ⌈(-
      7
      (-
        ⌊(value-of <<v>> ρ)⌋
        ⌊(value-of <<i>> ρ)⌋))⌉

＝ ⌈(-
      7
      (-
        5
        ⌊(value-of <<i>> ρ)⌋))⌉

＝ ⌈(-
      7
      (-
        5
        1))⌉

＝ ⌈(-
      7
      4)⌉

＝ ⌈3⌉